Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་ག་ཡ་ན་ག་ཡ་མགོའི་རི་ལ་དགེ་སློང་བདུན་ཁྲི་ཉིས་སྟོང་གི། དགེ་འདུན་ཆེན་པོ་དག་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ།
en: The Blessed One was residing at Gayā­śīrṣa Hill in the Gayā region together with a great saṅgha of seventy-two thousand monks.

source: ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ།
en: All of them were worthy ones who had brought the defilements to exhaustion.

source: ཉོན་མོངས་པ་མེད་པ། དབང་དང་ལྡན་པར་གྱུར་པ།
en: They were free from affliction and composed.

source: སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: Their minds were fully liberated. Their insight was fully liberated.

source: ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ། བྱ་བ་བྱས་པ། བྱེད་པ་བྱས་པ།
en: They were beings of noble birth, great elephants, who had accomplished their tasks and completed their work.

source: བུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ།
en: They had laid down their burden and fulfilled their objectives.

source: སྲིད་པར་ཀུན་ཏུ་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ། བཀའ་ཡང་དག་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ།
en: With all their bonds to existence exhausted, they had reached the utter liberation of the mind by means of genuine knowledge.

source: སེམས་ཀྱི་དབང་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་ཏུ་སོན་པ། ཆོས་ཀྱི་དབྱིངས་ལ་མཁས་པ།
en: They had reached the final culmination of complete mastery over mind and were experts with respect to the realm of phenomena.

source: ཆོས་ཀྱི་རྒྱལ་པོའི་སྲས།
en: They were children of the King of Dharma.

source: སེམས་རྙེད་པ་དང་། བཀུར་སྟི་ཐམས་ཅད་དང་བྲལ་བ།
en: Completely disinterested in acquisitions and praise,

source: ལེགས་པར་རབ་ཏུ་བྱུང་བ། ལེགས་པར་བསྙེན་པར་རྫོགས་པ། བརྣག་པ་ཡོངས་སུ་རྫོགས་པ།
en: they were true renunciants, who had completed their ordination and perfected their pursuits.

source: མྱ་ངན་ལས་འདའ་བའི་ལམ་ལ་གནས་པ་ཤ་སྟག་སྟེ།
en: Thus, they all remained upon the path to nirvāṇa

source: གང་ཟག་གཅིག་མ་གཏོགས་པ་ནི་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོའོ།
en: —all except for one: the venerable Ā­nanda.

source: བྱང་ཆུབ་སེམས་དཔའ་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དང་ཡང་ཐབས་ཅིག་སྟེ། ཐམས་ཅད་ཀྱང་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ།
en: The Blessed One was also accompanied by a great gathering of eighty-four thousand bodhisattvas, all of whom were obstructed by only a single birth.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་མངོན་དུ་ཕྱོགས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གཞོལ་བ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་འབབ་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་བབ་པ།
en: They were all turned toward omniscience, pursuing omniscience, approaching omniscience, and reaching omniscience.

source: ཆགས་པ་མེད་པའི་གཟུངས་དང་ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: They had all attained unimpeded retention and absorption,

source: དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ལ་ཤིན་ཏུ་གནས་པ།
en: entered the absorption of the heroic gait,

source: མངོན་པར་ཤེས་པ་ཆེན་པོས་རྣམ་པར་རོལ་པ།
en: reveling in magnificent forms of superknowledge.

source: ལམ་གྱི་རྒྱུན་མ་བཅད་པ། སྒྲིབ་པ་དང་། ཆོད་པ་དང་། ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་དང་བྲལ་བ།
en: Their path was uninterrupted, and they were entirely free of obscurations, hindrances, or disturbances.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཁྱབ་པར་བྱེད་པ།
en: They spread their great love and compassion throughout all the worlds of the ten directions,

source: སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་པར་འགྲོ་བ་ལ་མཁས་པ།
en: they were experts in traveling to infinite buddha realms.

source: སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ། མཚན་མ་མེད་པ་ལ་གནས་པ། སྨོན་ལམ་ལ་གནས་པ་ཐམས་ཅད་དང་བྲལ་བ།
en: They experienced emptiness, remained within the absence of marks, and were free from any fixation on wishes.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་བརྩོན་པ། སངས་རྒྱས་ཀྱི་ཡུལ་ཐམས་ཅད་ལ་མཁས་པ་ཡེ་ཤེས་མཐའ་ཡས་པ།
en: They pursued the welfare of all beings and were experts with respect to the entire domain of the buddhas.

source: སེམས་ནམ་མཁའ་དང་མཚུངས་པ། སེམས་རྒྱ་མཚོ་ལྟར་ཟབ་པ། སེམས་རིའི་རྒྱལ་པོ་རི་རབ་ལྟར་མི་སྒུལ་བ།
en: Their wisdom was boundless, their minds were vast like the sky, deep as the sea, and unshakable like Sumeru, the king of mountains.

source: སེམས་པད་མ་ལྟར་མ་གོས་པ། སེམས་རིན་པོ་ཆེ་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་དག་པ། སེམས་གསེར་ལྟར་ཤིན་ཏུ་ཡོངས་སུ་བྱང་བ་རྣམས་ལ་འདི་ལྟ་སྟེ།
en: Like lotuses, their minds were unstained; like jewels, their minds were pure; like gold, their minds were refined.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་
en: Among them were the bodhisattva great beings

source: རིན་པོ་ཆེའི་དཔལ་
en: Ratna­ketu,

source: ལག་ན་རྡོ་རྗེ་རིན་པོ་ཆེ་
en: Ratna­pāṇi,

source: ལག་ན་ཕྱག་རྒྱ་རིན་པོ་ཆེ་
en: Ratna­mudrā­hasta,

source: རིན་པོ་ཆེའི་ཅོད་པན་
en: Ratna­mu­kuṭa,

source: གཙུག་ན་རིན་པོ་ཆེ་
en: Ratna­cūḍa,

source: རིན་པོ་ཆེ་བརྩེགས་པ་
en: Ratna­kūṭa,

source: རིན་པོ་ཆེ་འབྱུང་གནས་
en: Ratnā­kara,

source: རིན་པོ་ཆེའི་རྩེ་མོ་
en: Ratna­śikhara,

source: རིན་པོ་ཆེའི་རྒྱལ་མཚན་
en: Ratna­dhvaja,

source: རྡོ་རྗེའི་སྙིང་པོ་
en: Vajragarbha,

source: གསེར་གྱི་སྙིང་པོ་
en: Su­varṇa­garbha,

source: རིན་པོ་ཆེའི་སྙིང་པོ་
en: Ratna­garbha,

source: དཔལ་གྱི་སྙིང་པོ་
en: Śrī­garbha,

source: དགེ་བའི་སྙིང་པོ་
en: Śubha­garbha,

source: དགེ་བ་དྲི་མ་མེད་པའི་སྙིང་པོ་
en: Śubha­vi­mala­garbha,

source: དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་
en: Tathāgata­garbha,

source: ཡེ་ཤེས་ཀྱི་སྙིང་པོ་
en: Jñāna­garbha,

source: ཉི་མའི་སྙིང་པོ་
en: Sūrya­garbha,

source: ཏིང་ངེ་འཛིན་གྱི་སྙིང་པོ་
en: Samādhi­garbha,

source: པད་མའི་སྙིང་པོ་
en: Padma­garbha,

source: རྣམ་པར་གྲོལ་བའི་ཟླ་བ་
en: Vi­mukti­candra,

source: ཀུན་ཏུ་ཟླ་བ་
en: Sa­manta­candra,

source: སྤྱན་རས་གཟིགས་དབང་པོ་
en: Avalo­kiteś­vara,

source: མཐུ་ཆེན་ཐོབ་
en: Mahā­sthāma­prāpta,

source: ཀུན་ཏུ་བཟང་པོ་
en: Sa­manta­bhadra,

source: ཀུན་ནས་མིག་
en: Sa­manta­netra,

source: པད་མའི་མིག་
en: Padma­netra,

source: དྲི་མ་མེད་པའི་མིག་
en: Vi­mala­netra,

source: ཡངས་པའི་མིག་
en: Vi­śāla­netra,

source: ཀུན་ཏུ་སྤྱོད་ལམ་
en: Sa­manterya­patha,

source: ཀུན་ཏུ་མཛེས་
en: Sa­manta­prāsā­dika,

source: ཀུན་ཏུ་སྤྱོད་པའི་བློ་གྲོས་
en: Sa­manta­cāri­tra­mati,

source: ཡེ་ཤེས་ཀྱི་བློ་གྲོས་
en: Jñāna­mati,

source: ཆོས་ཀྱི་བློ་གྲོས་
en: Dharma­mati,

source: རྒྱལ་བའི་བློ་གྲོས་
en: Jaya­mati,

source: བླ་མའི་བློ་གྲོས་
en: Uttara­mati,

source: རྡོ་རྗེའི་བློ་གྲོས་
en: Vajra­mati,

source: ཁྱད་པར་བླ་གྲོས་
en: Vi­śeṣa­mati,

source: སེང་གེ་རྣམ་པར་རོལ་པ་
en: Siṁha­vi­krī­ḍita,

source: སྒྲ་ཆེན་པོའི་དབྱངས་ཀྱི་རྒྱལ་པོ་
en: Mahā­ghoṣa­svara­rāja,

source: སེང་གེའི་སྒྲ་སྒྲོགས་
en: Siṁha­nāda­nādin,

source: སྒྲ་དབྱངས་བརྗོད་པ་ཟབ་མོ་སྒྲོགས་
en: Gambhī­raghoṣa­svaranā­dita,

source: གོས་པ་མེད་
en: A­nupa­lipta,

source: དྲི་མ་ཀུན་བྲལ་
en: Sarva­malā­pa­gata,

source: ཟླ་བའི་འོད་
en: Candra­prabha,

source: ཉི་མའི་འོད་
en: Sūrya­prabha,

source: ཡེ་ཤེས་ཀྱི་འོད་
en: Jñāna­prabha,

source: ཡེ་ཤེས་ཀྱི་དཔལ་
en: Jñāna­śrī,

source: བཟང་པོའི་དཔལ་
en: Bhadraśrī,

source: ཟླ་བའི་དཔལ་
en: Candra­śrī,

source: པད་མའི་དཔལ་
en: Padma­śrī,

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་
en: Mañju­śrī­kumāra­bhūta,

source: བཟང་སྐྱོང་ལ་སོགས་པ་སྐྱེས་བུ་དམ་པ་བཅུ་དྲུག་
en: Bhadra­pāla and the others among the sixteen holy beings,

source: བྱམས་པ་ལ་སོགས་པ་བསྐལ་པ་བཟང་པོའི་
en: Maitreya and all the other bodhisattva great beings of the excellent eon.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་ལ་སོགས་པ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་།
en: Present there were also the four great kings and the others gods of the Heaven of the Four Great Kings,

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་སོགས་པ་སུམ་ཅུ་རྩ་གསུམ་གྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་།
en: Śakra, king of the gods, along with the other gods of the Heaven of the Thirty-Three.

source: ལྷའི་བུ་ཤིན་ཏུ་གནོད་བྲལ་ལ་ལ་སོགས་པ་གནོད་བྲལ་གྱི་ལྷའི་བུ་རྣམས་དང་།
en: Present there were the gods of the Heaven Free from Strife, such as Su­yāma;

source: ལྷའི་བུ་ཀུན་ཏུ་དགའ་ལྡན་ལ་སོགས་པ་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་།
en: the gods of the Heaven of Joy, such as Saṃ­tuṣita;

source: ལྷའི་བུ་ཤིན་ཏུ་འཕྲུལ་དགའ་ལ་སོགས་པ་འཕྲུལ་དགའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་།
en: the gods of the Heaven of Delighting in Emanations, such as Su­nirmi­ta;

source: ལྷའི་བུ་དབང་བྱེད་ལ་སོགས་པ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་དང་།
en: the gods of the Heaven of Making Use of Others’ Emanations, such as Vaśa­vartin.

source: དེད་དཔོན་ལ་སོགས་པ་དཀར་པོའི་ཕྱོགས་ཀྱི་བདུད་ཀྱི་བུ་རྣམས་དང་།
en: Present were Sārtha­vāha and other such māras of the side of virtue,

source: ཚངས་པ་ཆེན་པོ་ལ་སོགས་པ་ཚངས་པའི་རིས་ཀྱི་ལྷའི་བུ་ཐམས་ཅད་དང་།
en: Mahā­brahmā and all the gods of the Realm of Brahmā,

source: ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་ཐམས་ཅད་དང་།
en: Mahe­śvara accompanied by all the gods of the pure abodes.

source: ལྷ་མ་ཡིན་གྱི་དབང་པོ་ཐགས་ཟངས་རིས་དང་། སྟོབས་ཅན་དང་། ནོར་སྦྱིན་དང་། དེ་དག་ལ་སོགས་པ་ལྷ་མ་ཡིན་བརྒྱ་སྟོང་དུ་མ་དང་།
en: Present were Vema­citra, Balin, and Dhan­ada, rulers of the demigods, along with many hundreds of thousands of demigods.

source: ཀླུའི་རྒྱལ་པོ་མ་དྲོས་པ་དང་། གཟི་ཅན་དང་། རྒྱ་མཚོ་དང་། མཐའ་ཡས་དང་། ནོར་རྒྱས་ཀྱི་བུ་དང་། དེ་དག་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོ་བརྒྱ་སྟོང་དུ་མ་དང་།
en: Present also were the nāga kings A­nava­tapta, Manasvin, Sā­gara, A­nanta, and Vāsuki, along with many hundreds of thousands of other kings of the nāgas;

source: དཔལ་གྱི་གཟི་བརྗིད་ལ་སོགས་པ་ཀླུའི་རྒྱལ་པོའི་ཁྱེའུ་བརྒྱ་སྟོང་དུ་མ་དང་། ཀླུའི་བུ་མོ་མང་པོ་རྣམས་དང་།
en: many hundreds of thousands of nāga princes, such as Śrī­tejas; and numerous nāga ladies.

source: དེ་མ་ཡིན་པ་གཞན་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་བརྒྱ་སྟོང་དག་དང་ཡང་ཐབས་ཅིག་གོ། །
en: Present also were hundreds of thousands of gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, and mahoragas.

source: ཡང་དེའི་ཚེ་ག་ཡ་ན་ག་ཡ་མགོའི་རིའི་
en: At the time, the area surrounding Gayā­śīrṣa Hill in the Gayā region

source: ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་མི་མ་ཡིན་པ་
en: gods, nāgas, yakṣas, gandharvas, demigods, garuḍas, kinnaras, mahoragas, humans, and nonhumans.

source: གང་བར་གྱུར་པའི་སའི་ཕྱོགས་སམ། བར་སྣང་གི་ཕྱོགས་
en: These beings filled the land and the sky

source: དཔག་ཚད་བཞི་ཁོ་ར་ཁོར་ཡུག་ཏུ་
en: to a radius of four leagues,

source: སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་རྡུལ་ཕྲ་རབ་ཙམ་ཡང་གང་
en: even a particle the size of a fraction of the tip of a hair

source: འཁོར་དེ་ལྟ་བུ་འདུས་ཤིང་འཁོད་པའི་དབུས་ན་བཅོམ་ལྡན་འདས་ཀྱི་སེང་གེའི་ཁྲི་འཕང་དུ་
en: At the center of this assembly was the lion throne of the Blessed One.

source: དཔག་ཚད་གཅིག །ཁོ་ར་ཁོར་ཡུག་ཏུ་དཔག་ཚད་ཕྱེད་པ་ལ་ལྷའི་རས་བཅོས་བུ་དུ་མ་ནི་བཏིང་།
en: One league tall and half a league wide, the throne was cushioned with numerous divine fabrics,

source: རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཁའི་དྲ་བས་ནི་བླ་རེ་བྲེས།
en: canopied with webs of jewel bells,

source: དར་གྱི་ལྡ་ལྡི་བརྒྱ་སྟོང་དུ་མ་ནི་དཔྱངས།
en: draped with hundreds of thousands of brocade tassels,

source: མེ་ཏོག་སིལ་མས་ནི་གཏོར་བ་ཞིག་བཤམས་ཏེ།
en: adorned with scattered flowers.

source: སེང་གེའི་ཁྲི་དེའི་ཁོ་ར་ཁོར་ཡུག་གི་སའི་ཕྱོགས་དེ་དངོས་རྡོ་རྗེ་ལ་ཡིད་དུ་འོང་ཞིང་ལག་མཐིལ་ལྟར་མཉམ་པ་དང་།
en: The vajra surface of the ground where the throne stood was delightful and smooth, like the palm of a hand.

source: ཆག་ཆག་ལེགས་པར་བཏབ་པ་དང་། ཕྱག་དར་ལེགས་པར་བྱས་པ་དང་།
en: Well sprinkled and well swept,

source: དྲི་རབ་ཏུ་ཞིམ་ཞིང་ལྷའི་མེ་ཏོག་བརྒྱ་སྟོང་དུ་མས་གཏོར་བར་གྱུར་ཏོ།
en: the ground was fragrant and covered with a scattering of many hundreds of thousands of divine flowers.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡོངས་སུ་ལོངས་སྤྱད་པའི་ཕྱིར་ཕྱོགས་དེ་ན་གསེར་གྱི་པད་མ་
en: For the sake of the Blessed One’s enjoyment, the area had golden lotus flowers,

source: ཤིང་རྟའི་འཁོར་ལོ་ཙམ། འདབ་མ་བརྒྱ་སྟོང་དུ་མ་ཡོད་པ། །
en: each the size of a chariot wheel and with many hundred thousand petals.

source: ཆུ་བ་ནི་བཻ་དཱུརྱ། སྙིང་པོ་ནི་ཨིན་དྲ་ནཱི་ལ། ཟེ་བ་ནི་ཨསྨ་གར་བྷ་སྟེ།
en: These lotuses grew from stems of beryl, had cores of sapphire, and their anthers were of emerald.

source: དྲི་རབ་ཏུ་ཞིམ་ཞིང་ཡིད་དུ་འོང་ལ་རེག་ན་དགའ་བར་འགྱུར་བ་དག་སྐྱེས་པར་གྱུར་ཏོ།
en: They had a captivating scent, were of perfect beauty, and were delightful to the touch.

source: སེང་གེའི་ཁྲི་དེའི་གྲྭ་བཞིར་ཧ་ཅང་ཡང་མི་རིང་། ཧ་ཅང་ཡང་མི་ཉེ་བ་ནས་རིན་པོ་ཆེའི་ཤིང་
en: Not too far yet not too close to each of the throne’s four corners stood a jewel tree.

source: སྲིད་དུ་དཔག་ཚད་ཕྱེད་དང་གཉིས། སྦོམས་སུ་རྒྱང་གྲགས་གཉིས་ཀྱིས་འཁོར་བ་བཞི་སྐྱེས་སོ།
en: Each of the trees had grown to a height of two and a half leagues with a trunk that reached a width of two krośas.

source: སེང་གེའི་ཁྲི་ལེགས་པར་བཤམས་པ་དེ་ལ་བཅོམ་ལྡན་འདས་
en: Seated upon this well-arranged throne was the Blessed One.

source: བློ་ནི་རབ་ཏུ་རྣམ་པར་དག །ཆོས་ཀྱི་འཁོར་ལོ་ནི་རབ་ཏུ་བསྐོར།
en: With perfectly pure wisdom, he was turning the wheel of Dharma.

source: བདུད་དང་ཕྱིར་རྒོལ་བ་ནི་བཅོམ། འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་ནི་མ་གོས་ལ་
en: Conquering all māras and opponents, he remained unblemished by any mundane qualities.

source: མི་བསྙེངས་ཤིང་མི་འཛེམ་སྟེ། སེང་གེ་ལྟར་བག་ཚ་བ་མེད་པ།
en: He was fearless and indomitable, like a dauntless lion.

source: མཚོ་དང་འདྲ་བར་དང་སྟེ་རྙོག་པ་མེད་ཅིང་ཤིན་ཏུ་རྣམ་པར་དང་བ།
en: He was clear like a lake, immaculate and lucid.

source: རྒྱ་མཚོ་ཆེན་པོ་ལྟར་ཟབ་ཅིང་གཏིང་དཔག་དཀའ་ལ་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་གྱུར་པ།
en: Resembling the ocean, he was deep and hard to fathom, a source of jewels.

source: རི་རབ་ལྟར་མངོན་པར་འཕགས་པ། ཉི་མ་ལྟར་རབ་ཏུ་ལྷན་པ། ཟླ་བ་ལྟར་རབ་ཏུ་སིམ་པ།
en: He was truly elevated like the king of mountains, sparkling like the sun, and delightful like the moon.

source: ཀླུ་ཆེན་པོ་ལྟར་ཆོས་ཀྱི་ཆར་མངོན་པར་འབེབས་པ།
en: Like a great nāga, he let the rain of Dharma fall.

source: ཚངས་པ་ཆེན་པོ་ལྟར་འཇིག་རྟེན་ཀུན་ལས་མངོན་པར་འཕགས་པ།
en: Like Mahā­brahmā, he was the whole world’s superior.

source: སློབ་མ་ཤིན་ཏུ་དུལ་བའི་ཚོགས་མཐའ་ཡས་པའི་འཁོར་མངའ་བ། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རྣམས་ཀྱིས་ཞལ་དུ་བལྟས་ཤིང་མ་ཁེངས་མ་དུད་པར་བཞུགས་ཏེ།
en: The master of an infinite circle of extremely adept disciples, he was the center of attention for the entire great assembly that contained Śakra, Brahmā, and one hundred sextillion guardians of the world.

source: འཁོར་ཚོགས་པ་དེ་ན་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེའོ། །བཅོམ་ལྡན་འདས་
en: Within this gathering the Blessed One was magnificent, brilliant, and resplendent.

source: དེ་ལྟར་ལྷམ་མེ། ལྷན་ནེ། ལྷང་ངེ་བའི་དབུའི་གཙུག་གི་གཙུག་ཏོར་གྱི་གསེབ་ནས་འོད་ཟེར་ཀུན་ཏུ་སྣང་བ་
en: From the magnificent, brilliant, and resplendent uṣṇīṣa upon his head shone forth millions of circles of light,

source: ཞེས་བྱ་བ་འོད་ཟེར་གྱི་འཁོར་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཡོད་པ་བྱུང་སྟེ།
en: forming what is known as the light of universal illumination

source: དེ་བྱུང་ནས་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་འཇིག་རྟེན་གྱི་ཁམས་རབ་འབྱམ་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ།
en: As this light shone forth, all the worlds in the ten directions were illuminated.

source: ཕྱིར་འོངས་ནས་བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས་ཞུགས་ནས།
en: The light then returned and circled around the Blessed One three times before it entered his mouth.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ཕྱེ་བའམ་བཙུམས་པར་ཡང་མི་མངོན་ནོ། །
en: At that point, it could not be seen whether the Blessed One’s mouth was open or closed.

source: འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་དང་ཟླ་བའི་འོད་ནམ་མཁའི་ཁམས་ཐམས་ཅད་ཀྱི་གསེབ་ཏུ་ཞུགས་ཀྱང་ནམ་མཁའི་ཁམས་ཀྱི་གསེབ་ཕྱེ་བའམ་བཙུམས་པར་མི་མངོན་པ་དེ་བཞིན་དུ།
en: Similarly, the light of the sun or the moon may enter the expanse of space, and yet the expanse of space cannot be seen to be either open or closed.

source: དེའི་ཚེ་ན་འོད་ཟེར་དེ་དག་ཞུགས་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ཕྱེ་བའམ་བཙུམས་པར་མི་མངོན་ནོ། །
en: In the same way, these light rays entered the mouth of the Blessed One, and yet his mouth could not be seen to be either open or closed.

source: འདི་ལྟ་སྟེ་དཔེར་ན། བྱེ་མའི་ཕུང་པོ་ལ་མར་རམ་འབྲུ་མར་རམ། ཆུ་ཞུགས་ན་མི་མངོན་པ་དེ་བཞིན་དུ། །
en: Moreover, when melted butter, or oil, or water is poured onto a mound of sand, it cannot be said whether the mound is open or closed.

source: དེ་བཞིན་དུ། དེའི་ཚེ་ན་འོད་ཟེར་དེ་དག་ཞུགས་ཀྱང་ཕྱེ་བའམ་བཙུམས་པར་མི་མངོན་ནོ། །
en: Similarly, although the light rays entered the Blessed One’s mouth, his mouth could not be seen to be either open or closed.

source: དེ་ནས་ཤར་ཕྱོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན།
en: Now, to the east of this buddha realm, beyond as many worlds as there are grains of sand in the river Gaṅgā,

source: པད་མ་ཅན་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན། པད་མའི་སྤྱན་ཞེས་བྱ་བ་
en: there is a world known as Realm of Lotuses. Therein resides the one known as Padma­netra.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་རྐང་པར་ལྡན་པ།
en: He is a thus-gone one, a worthy one, a perfect buddha, someone with proper knowledge and conduct,

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: a well-gone one, a knower of the world, an unsurpassed leader of those to be trained, a teacher of gods and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་འདི་ལྟ་སྟེ། ཐེག་པ་གཅིག་ལས་བརྩམས་ནས་ཆོས་སྟོན་ཏེ།
en: That blessed buddha teaches the Dharma to bodhisattva great beings in terms of a single vehicle.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དག་དང་། ཉན་ཐོས་ཀྱི་ཐེག་པའམ། རང་སངས་རྒྱས་ཀྱི་ཐེག་པའི་མིང་ཡང་མེད།
en: Thus, in that buddha realm even the words “listener” or “solitary buddha” are unheard of, as are the names of their respective vehicles.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་རྫུས་ཏེ་སྐྱེ་བ་མ་གཏོགས་པར་བུད་མེད་དང་། མངལ་ན་གནས་ཏེ་འབྱུང་ཞིང་སྐྱེ་བའི་སྒྲ་ཡང་མི་གྲག་གོ།
en: Everyone in that buddha realm takes birth instantaneously, such that birth from the wombs of females is unheard of.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཤ་སྟག་གོ།
en: All the sentient beings of that realm are, without exception, bodhisattvas whose progress toward unexcelled and complete awakening is irreversible.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་བཟའ་བ་དང་། བཏུང་བ་དང་། ཟས་ཀྱི་བྱ་བ་ཡང་མི་ཤེས་སོ།
en: In that realm food, drink, and their consumption are all unknown.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་བསམ་གཏན་གྱི་དགའ་བའི་ཟས་ཅན་དང་། ཏིང་ངེ་འཛིན་གྱི་དགའ་བའི་ཟས་ཅན་དང་། ཆོས་ཀྱི་དགའ་བའི་ཟས་ཅན་ནོ།
en: All the bodhisattvas of that realm partake of the delightful sustenance of concentration, the delightful sustenance of absorption, and the delightful sustenance of the Dharma.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཉིད་ཀྱི་འོད་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཁྱབ་
en: The light that shines from that thus-gone one pervades that realm and illuminates it.

source: ཅིང་དྲི་མ་མེད་པར་གྱུར་པ་མ་གཏོགས་པར་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་ཟླ་བ་དང་། ཉི་མ་དང་། གཟའ་དང་། སྐར་མ་རྣམས་ཀྱི་འོད་ཀྱང་མི་ཤེས་སོ།
en: Apart from that, that world knows of no moonlight or sunlight, nor of any light from planets or stars.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་ལག་མཐིལ་བཞིན་དུ་མཉམ་པར་གྱུར་པ་ལས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རྩྭ་དང་། ཤིང་དང་། བོང་བ་དང་། རྩིག་པ་དང་། རི་ལ་སོགས་པ་ཡང་མི་སྣང་ངོ་།
en: The land there is perfectly even, like the palm of a hand, and there are no grasses, trees, rocks, walls, or mountains.

source: འཇིག་རྟེན་གྱི་ཁམས་དེ་འདྲ་བ་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བ་
en: In that realm there was a bodhisattva great being known as Sarva­nīvaraṇa­viṣkam­bhin,

source: དེའི་མིང་ཐོས་པ་ཙམ་གྱིས་སེམས་ཅན་གྱི་སྒྲིབ་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་བ་ཞིག་གནས་ཏེ།
en: who had the power to exhaust all the obscurations of whoever merely heard his name.

source: དེས་རེག་སྟེ་བསྐུལ་ནས།
en: touched and inspired

source: རང་གི་གནས་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: he left his own abode and journeyed to the place where Buddha Padma­netra was residing.

source: བཅོམ་ལྡན་འདས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: He bowed his head down to the feet of the Blessed One

source: པད་མའི་སྙིང་པོ་ལ་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ།
en: and took his seat before Padma­netra.

source: དེ་མ་ཡིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་གཞན་དག་ཀྱང་འོད་དེས་རེག་སྟེ་བསྐུལ་བ་དང་།
en: Similarly, other bodhisattvas were touched and inspired by the light,

source: རང་རང་གི་གནས་ནས་བྱུང་སྟེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེ་ག་ལ་བ་དེར་དོང་སྟེ་ཕྱིན་ནས།
en: so they also left their respective residences and went to see the blessed thus-gone Padma­netra.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་སྟན་ལས་ལངས་ནས་
en: At that time the bodhisattva great being Sarva­nīvaraṇa­viṣkam­bhin rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་པད་མའི་སྙིང་པོ་ལ་བཙུགས་ནས།
en: draped his shawl over one shoulder, and knelt with his right knee in the center of a lotus flower.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་
en: Joining his palms, he bowed toward the blessed thus-gone Padma­netra.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་བུའི་འོད་བཟང་པོ་དྲི་མ་མ་མཆིས་པ་རྣམ་པར་དག་པ། ཡིད་དུ་མཆི་བ་ལུས་དང་སེམས་ཤིན་ཏུ་དགའ་བར་བགྱིད་པར་བྱུང་བ་འདི་སུའི་མཐུ་ལགས་ཞེས་དེ་སྐད་ཅེས་གསོལ་པ་
en: “Blessed One,” he asked, “by whose power is it that this excellent light emerges, which is so bright, immaculate, delightful, and utterly gratifying for the body and mind?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The blessed thus-gone Padma­netra replied,

source: རིགས་ཀྱི་བུ་ནུབ་ཕྱོགས་ན་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་འཇིག་རྟེན་གྱི་ཁམས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་འདས་པ་ན་མི་མཇེད་ཅེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཡོད་དེ།
en: “Noble son, in the west, beyond as many worlds as there are grains of sand in the river Gaṅgā, there is a world known as Endurance.

source: དེ་ན་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བ་
en: Therein resides the one known as Śākyamuni.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་། རྐང་པར་ལྡན་པ།
en: He is a thus-gone, worthy, perfect buddha, someone with proper knowledge and conduct,

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ།
en: a well-gone one, a knower of the world, an unsurpassed leader of those to be trained, a teacher of gods and humans.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེའི་མཚན་ཐོས་པ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བ་ཞིག་བཞུགས་ཏེ།
en: Whoever merely hears this blessed buddha’s name will make progress toward unexcelled and complete awakening that is irreversible.

source: དེས་འོད་བཟང་པོ་དྲི་མ་མེད་པ། རྣམ་པར་དག་པ་ཡིད་དུ་འོང་བ། ལུས་དང་སེམས་ཤིན་ཏུ་རྣམ་པར་དགའ་བར་བྱེད་པ་འདི་ཕྱུང་ངོ་།
en: It is he who sends forth this excellent light that is bright, immaculate, delightful, and utterly gratifying for the body and the mind.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Further addressing the blessed thus-gone Padma­netra, the bodhisattva great being Sarva­nīvaraṇa­viṣkam­bhin then asked,

source: རྒྱུ་གང་ལགས། རྐྱེན་གང་ལགས
en: what is the cause and what is the condition

source: དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པ་ཙམ་གྱིས་སེམས་ཅན་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར་བའི་
en: so that whoever hears the name of that thus-gone one will make irreversible progress toward unexcelled and complete awakening?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་པད་མའི་སྤྱན་དེས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: To the bodhisattva great being Sarva­nīvaraṇa­viṣkam­bhin the blessed thus-gone Padma­netra replied,

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་དེས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན།
en: “Noble son, when that thus-gone one was still pursuing the practices of a bodhisattva,

source: འདི་ལྟར་སེམས་ཅན་སུ་གང་དག་གིས་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་མིང་ཐོས་པ་
en: ‘Whenever someone hears the name under which I shall gain perfect buddhahood,

source: དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་ཤོག་ཤིག་ཅེས་
en: may that being thereby make irreversible progress toward unexcelled and complete awakening!’
